---
kind: type
id: T:Autodesk.Revit.DB.Events.DocumentReloadingLatestEventArgs
source: html/0952bb8e-fa8d-382a-ba2b-97bbbc820a99.htm
---
# Autodesk.Revit.DB.Events.DocumentReloadingLatestEventArgs

The event arguments used by the DocumentReloadingLatest event.

## Syntax (C#)
```csharp
public class DocumentReloadingLatestEventArgs : RevitAPIPreDocEventArgs
```